#include "ast.h"

#include <assert.h>
#include <fstream>

#include "support.h"

namespace cli {

//#include "functions_compile_cli.inc"

std::vector<uint8_t> &operator<<(std::vector<uint8_t> &a, uint8_t u8)
{
    a.push_back(u8);
    return a;
}

std::vector<uint8_t> &operator<<(std::vector<uint8_t> &a, int16_t s16)
{
    a.push_back((s16      ) & 0xff);
    a.push_back((s16 >>  8) & 0xff);
    return a;
}

std::vector<uint8_t> &operator<<(std::vector<uint8_t> &a, uint16_t u16)
{
    a.push_back((u16      ) & 0xff);
    a.push_back((u16 >>  8) & 0xff);
    return a;
}

std::vector<uint8_t> &operator<<(std::vector<uint8_t> &a, uint32_t u32)
{
    a.push_back((u32      ) & 0xff);
    a.push_back((u32 >>  8) & 0xff);
    a.push_back((u32 >> 16) & 0xff);
    a.push_back((u32 >> 24) & 0xff);
    return a;
}

std::vector<uint8_t> &operator<<(std::vector<uint8_t> &a, uint64_t u64)
{
    a.push_back((u64      ) & 0xff);
    a.push_back((u64 >>  8) & 0xff);
    a.push_back((u64 >> 16) & 0xff);
    a.push_back((u64 >> 24) & 0xff);
    a.push_back((u64 >> 32) & 0xff);
    a.push_back((u64 >> 40) & 0xff);
    a.push_back((u64 >> 48) & 0xff);
    a.push_back((u64 >> 56) & 0xff);
    return a;
}

std::vector<uint8_t> &operator<<(std::vector<uint8_t> &a, const std::vector<uint8_t> &b)
{
    std::copy(b.begin(), b.end(), std::back_inserter(a));
    return a;
}

std::vector<uint8_t> &operator<<(std::vector<uint8_t> &a, const std::string &s)
{
    std::copy(s.begin(), s.end(), std::back_inserter(a));
    a << static_cast<uint8_t>(0);
    return a;
}

const uint8_t MS_DOS_header[128] = {
    0x4d,0x5a,0x90,0x00,0x03,0x00,0x00,0x00,
    0x04,0x00,0x00,0x00,0xFF,0xFF,0x00,0x00,
    0xb8,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x40,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x80,0x00,0x00,0x00,
    0x0e,0x1f,0xba,0x0e,0x00,0xb4,0x09,0xcd,
    0x21,0xb8,0x01,0x4c,0xcd,0x21,0x54,0x68,
    0x69,0x73,0x20,0x70,0x72,0x6f,0x67,0x72,
    0x61,0x6d,0x20,0x63,0x61,0x6e,0x6e,0x6f,
    0x74,0x20,0x62,0x65,0x20,0x72,0x75,0x6e,
    0x20,0x69,0x6e,0x20,0x44,0x4f,0x53,0x20,
    0x6d,0x6f,0x64,0x65,0x2e,0x0d,0x0d,0x0a,
    0x24,0x00,0x00,0x00,0x00,0x00,0x00,0x00
};

const uint16_t IMAGE_FILE_EXECUTABLE_IMAGE  = 0x0002;
const uint16_t IMAGE_FILE_32BIT_MACHINE     = 0x0100;

const uint16_t IMAGE_SUBSYSTEM_WINDOWS_CUI  = 0x3;

const uint32_t IMG_SCN_CNT_CODE                 = 0x00000020;
//const uint32_t IMG_SCN_CNT_INITIALIZED_DATA     = 0x00000040;
//const uint32_t IMG_SCN_CNT_UNINITIALIZED_DATA   = 0x00000080;
const uint32_t IMG_SCN_MEM_EXECUTE              = 0x20000000;
const uint32_t IMG_SCN_MEM_READ                 = 0x40000000;
//const uint32_t IMG_SCN_MEM_WRITE                = 0x80000000;

const uint32_t COMIMAGE_FLAGS_ILONLY = 0x00000001;

const uint16_t MethodAttributes_MemberAccess_Public = 0x0006;
const uint16_t MethodAttributes_Static              = 0x0010;

const uint32_t TypeAttributes_Visibility_Public = 0x00000001;

//const uint8_t ELEMENT_TYPE_END      = 0x00;
const uint8_t ELEMENT_TYPE_VOID     = 0x01;
const uint8_t ELEMENT_TYPE_STRING   = 0x0e;
const uint8_t ELEMENT_TYPE_SZARRAY  = 0x1d;

const uint8_t op_call  = 0x28;
const uint8_t op_ret   = 0x2A;
const uint8_t op_ldstr = 0x72;

inline uint32_t MemberRefParent_TypeRef(uint32_t i) {
    return static_cast<uint32_t>((i << 3) | 0);
}

inline uint32_t ResolutionScope_AssemblyRef(uint32_t i) {
    return static_cast<uint32_t>((i << 2) | 2);
}

struct PE_file_header {
    PE_file_header()
      : magic(0x4550),
        machine(0x14c),
        number_of_sections(1),
        time_date_stamp(0),
        pointer_to_symbol_table(0),
        number_of_symbols(0),
        optional_header_size(28+68+128),
        characteristics(IMAGE_FILE_EXECUTABLE_IMAGE | IMAGE_FILE_32BIT_MACHINE)
    {}
    uint32_t magic;
    uint16_t machine;
    uint16_t number_of_sections;
    uint32_t time_date_stamp;
    uint32_t pointer_to_symbol_table;
    uint32_t number_of_symbols;
    uint16_t optional_header_size;
    uint16_t characteristics;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << magic;
        r << machine;
        r << number_of_sections;
        r << time_date_stamp;
        r << pointer_to_symbol_table;
        r << number_of_symbols;
        r << optional_header_size;
        r << characteristics;
        return r;
    }
};

struct PE_header_standard_fields {
    PE_header_standard_fields()
      : magic(0x10b),
        lmajor(6),
        lminor(0),
        code_size(0),
        initialized_data_size(0),
        uninitialized_data_size(0),
        entry_point_rva(0),
        base_of_code(0),
        base_of_data(0)
    {}
    uint16_t magic;
    uint8_t lmajor;
    uint8_t lminor;
    uint32_t code_size;
    uint32_t initialized_data_size;
    uint32_t uninitialized_data_size;
    uint32_t entry_point_rva;
    uint32_t base_of_code;
    uint32_t base_of_data;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << magic;
        r << lmajor;
        r << lminor;
        r << code_size;
        r << initialized_data_size;
        r << uninitialized_data_size;
        r << entry_point_rva;
        r << base_of_code;
        r << base_of_data;
        return r;
    }
};

struct PE_header_Windows_NT_specific_fields {
    PE_header_Windows_NT_specific_fields()
      : image_base(0x400000),
        section_alignment(0x2000),
        file_alignment(0x200),
        os_major(5),
        os_minor(0),
        user_major(0),
        user_minor(0),
        subsys_major(5),
        subsys_minor(0),
        reserved(0),
        image_size(0),
        header_size(0),
        file_checksum(0),
        subsystem(IMAGE_SUBSYSTEM_WINDOWS_CUI),
        dll_flags(0),
        stack_reserve_size(0x100000),
        stack_commit_size(0x1000),
        heap_reserve_size(0x100000),
        heap_commit_size(0x1000),
        loader_flags(0),
        number_of_data_directories(0x10)
    {}

    uint32_t image_base;
    uint32_t section_alignment;
    uint32_t file_alignment;
    uint16_t os_major;
    uint16_t os_minor;
    uint16_t user_major;
    uint16_t user_minor;
    uint16_t subsys_major;
    uint16_t subsys_minor;
    uint32_t reserved;
    uint32_t image_size;
    uint32_t header_size;
    uint32_t file_checksum;
    uint16_t subsystem;
    uint16_t dll_flags;
    uint32_t stack_reserve_size;
    uint32_t stack_commit_size;
    uint32_t heap_reserve_size;
    uint32_t heap_commit_size;
    uint32_t loader_flags;
    uint32_t number_of_data_directories;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << image_base;
        r << section_alignment;
        r << file_alignment;
        r << os_major;
        r << os_minor;
        r << user_major;
        r << user_minor;
        r << subsys_major;
        r << subsys_minor;
        r << reserved;
        r << image_size;
        r << header_size;
        r << file_checksum;
        r << subsystem;
        r << dll_flags;
        r << stack_reserve_size;
        r << stack_commit_size;
        r << heap_reserve_size;
        r << heap_commit_size;
        r << loader_flags;
        r << number_of_data_directories;
        return r;
    }
};

struct PE_header_data_directories {
    PE_header_data_directories()
      : export_table_rva(0),
        export_table_size(0),
        import_table_rva(0),
        import_table_size(0),
        resource_table_rva(0),
        resource_table_size(0),
        exception_table_rva(0),
        exception_table_size(0),
        certificate_table_rva(0),
        certificate_table_size(0),
        base_relocation_table_rva(0),
        base_relocation_table_size(0),
        debug_rva(0),
        debug_size(0),
        copyright_rva(0),
        copyright_size(0),
        global_ptr_rva(0),
        global_ptr_size(0),
        tls_table_rva(0),
        tls_table_size(0),
        load_config_table_rva(0),
        load_config_table_size(0),
        bound_import_rva(0),
        bound_import_size(0),
        iat_rva(0),
        iat_size(0),
        delay_import_descriptor_rva(0),
        delay_import_descriptor_size(0),
        cli_header_rva(0),
        cli_header_size(0),
        reserved_rva(0),
        reserved_size(0)
    {}

    uint32_t export_table_rva;
    uint32_t export_table_size;
    uint32_t import_table_rva;
    uint32_t import_table_size;
    uint32_t resource_table_rva;
    uint32_t resource_table_size;
    uint32_t exception_table_rva;
    uint32_t exception_table_size;
    uint32_t certificate_table_rva;
    uint32_t certificate_table_size;
    uint32_t base_relocation_table_rva;
    uint32_t base_relocation_table_size;
    uint32_t debug_rva;
    uint32_t debug_size;
    uint32_t copyright_rva;
    uint32_t copyright_size;
    uint32_t global_ptr_rva;
    uint32_t global_ptr_size;
    uint32_t tls_table_rva;
    uint32_t tls_table_size;
    uint32_t load_config_table_rva;
    uint32_t load_config_table_size;
    uint32_t bound_import_rva;
    uint32_t bound_import_size;
    uint32_t iat_rva;
    uint32_t iat_size;
    uint32_t delay_import_descriptor_rva;
    uint32_t delay_import_descriptor_size;
    uint32_t cli_header_rva;
    uint32_t cli_header_size;
    uint32_t reserved_rva;
    uint32_t reserved_size;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << export_table_rva;
        r << export_table_size;
        r << import_table_rva;
        r << import_table_size;
        r << resource_table_rva;
        r << resource_table_size;
        r << exception_table_rva;
        r << exception_table_size;
        r << certificate_table_rva;
        r << certificate_table_size;
        r << base_relocation_table_rva;
        r << base_relocation_table_size;
        r << debug_rva;
        r << debug_size;
        r << copyright_rva;
        r << copyright_size;
        r << global_ptr_rva;
        r << global_ptr_size;
        r << tls_table_rva;
        r << tls_table_size;
        r << load_config_table_rva;
        r << load_config_table_size;
        r << bound_import_rva;
        r << bound_import_size;
        r << iat_rva;
        r << iat_size;
        r << delay_import_descriptor_rva;
        r << delay_import_descriptor_size;
        r << cli_header_rva;
        r << cli_header_size;
        r << reserved_rva;
        r << reserved_size;
        return r;
    }
};

struct PE_optional_header {
    PE_optional_header()
      : standard_fields(),
        NT_specific_fields(),
        data_directories()
    {}
    PE_header_standard_fields standard_fields;
    PE_header_Windows_NT_specific_fields NT_specific_fields;
    PE_header_data_directories data_directories;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << standard_fields.serialize();
        r << NT_specific_fields.serialize();
        r << data_directories.serialize();
        return r;
    }
};

struct Section_header {
    Section_header()
      : Name(),
        VirtualSize(0),
        VirtualAddress(0),
        SizeOfRawData(0),
        PointerToRawData(0),
        PointerToRelocations(0),
        PointerToLinenumbers(0),
        NumberOfRelocations(0),
        NumberOfLinenumbers(0),
        Characteristics(0)
    {}

    std::string Name;
    uint32_t VirtualSize;
    uint32_t VirtualAddress;
    uint32_t SizeOfRawData;
    uint32_t PointerToRawData;
    uint32_t PointerToRelocations;
    uint32_t PointerToLinenumbers;
    uint16_t NumberOfRelocations;
    uint16_t NumberOfLinenumbers;
    uint32_t Characteristics;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        assert(Name.length() <= 8);
        for (size_t i = 0; i < 8; i++) {
            if (i < Name.length()) {
                r << static_cast<uint8_t>(Name.at(i));
            } else {
                r << static_cast<uint8_t>(0);
            }
        }
        r << VirtualSize;
        r << VirtualAddress;
        r << SizeOfRawData;
        r << PointerToRawData;
        r << PointerToRelocations;
        r << PointerToLinenumbers;
        r << NumberOfRelocations;
        r << NumberOfLinenumbers;
        r << Characteristics;
        return r;
    }
};

struct Import_address_table {
    Import_address_table()
      : ImportLookupTable(0),
        DateTimeStamp(0),
        ForwarderChain(0),
        Name(0),
        ImportAddressTable(0)
    {}
    uint32_t ImportLookupTable;
    uint32_t DateTimeStamp;
    uint32_t ForwarderChain;
    uint32_t Name;
    uint32_t ImportAddressTable;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << ImportLookupTable;
        r << DateTimeStamp;
        r << ForwarderChain;
        r << Name;
        r << ImportAddressTable;
        return r;
    }
};

struct Import_lookup_table {
    Import_lookup_table(): HintNameTableRVA(0) {}
    uint32_t HintNameTableRVA;
    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << HintNameTableRVA;
        return r;
    }
};

struct CLI_header {
    CLI_header()
      : cb(72),
        MajorRuntimeVersion(2),
        MinorRuntimeVersion(0),
        MetaDataRVA(0),
        MetaDataSize(0),
        Flags(COMIMAGE_FLAGS_ILONLY),
        EntryPointToken(0),
        ResourcesRVA(0),
        ResourcesSize(0),
        StrongNameSignatureRVA(0),
        StrongNameSignatureSize(0),
        CodeManagerTableRVA(0),
        CodeManagerTableSize(0),
        VTableFixupsRVA(0),
        VTableFixupsSize(0),
        ExportAddressTableJumpsRVA(0),
        ExportAddressTableJumpsSize(0),
        ManagedNativeHeaderRVA(0),
        ManagedNativeHeaderSize(0)
    {}

    uint32_t cb;
    uint16_t MajorRuntimeVersion;
    uint16_t MinorRuntimeVersion;
    uint32_t MetaDataRVA;
    uint32_t MetaDataSize;
    uint32_t Flags;
    uint32_t EntryPointToken;
    uint32_t ResourcesRVA;
    uint32_t ResourcesSize;
    uint32_t StrongNameSignatureRVA;
    uint32_t StrongNameSignatureSize;
    uint32_t CodeManagerTableRVA;
    uint32_t CodeManagerTableSize;
    uint32_t VTableFixupsRVA;
    uint32_t VTableFixupsSize;
    uint32_t ExportAddressTableJumpsRVA;
    uint32_t ExportAddressTableJumpsSize;
    uint32_t ManagedNativeHeaderRVA;
    uint32_t ManagedNativeHeaderSize;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << cb;
        r << MajorRuntimeVersion;
        r << MinorRuntimeVersion;
        r << MetaDataRVA;
        r << MetaDataSize;
        r << Flags;
        r << EntryPointToken;
        r << ResourcesRVA;
        r << ResourcesSize;
        r << StrongNameSignatureRVA;
        r << StrongNameSignatureSize;
        r << CodeManagerTableRVA;
        r << CodeManagerTableSize;
        r << VTableFixupsRVA;
        r << VTableFixupsSize;
        r << ExportAddressTableJumpsRVA;
        r << ExportAddressTableJumpsSize;
        r << ManagedNativeHeaderRVA;
        r << ManagedNativeHeaderSize;
        return r;
    }
};

struct Stream_header {
    Stream_header(const std::string &name)
      : Offset(0),
        Size(0),
        Name(name)
    {}

    uint32_t Offset;
    uint32_t Size;
    std::string Name;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << Offset;
        r << Size;
        uint32_t x = static_cast<uint32_t>((Name.length() + 1 + 3) & ~3);
        r << Name;
        for (size_t i = Name.length() + 1; i < x; i++) {
            r << static_cast<uint8_t>(0);
        }
        return r;
    }
};

struct Metadata_root {
    Metadata_root()
      : Signature(0x424a5342),
        MajorVersion(1),
        MinorVersion(1),
        Reserved(0),
        Version("Standard CLI 2005"),
        Flags(0)
    {}

    uint32_t Signature;
    uint16_t MajorVersion;
    uint16_t MinorVersion;
    uint32_t Reserved;
    std::string Version;
    uint16_t Flags;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << Signature;
        r << MajorVersion;
        r << MinorVersion;
        r << Reserved;
        uint32_t x = static_cast<uint32_t>((Version.length() + 1 + 3) & ~3);
        r << x;
        r << Version;
        for (size_t i = Version.length() + 1; i < x; i++) {
            r << static_cast<uint8_t>(0);
        }
        r << Flags;
        return r;
    }
};

struct Assembly {
    static const uint8_t Number = 0x20;
    Assembly()
      : HashAlgId(0),
        MajorVersion(0),
        MinorVersion(0),
        BuildNumber(0),
        RevisionNumber(0),
        Flags(0),
        PublicKey(0),
        Name(0),
        Culture(0)
    {}

    uint32_t HashAlgId;
    uint16_t MajorVersion;
    uint16_t MinorVersion;
    uint16_t BuildNumber;
    uint16_t RevisionNumber;
    uint32_t Flags;
    uint32_t PublicKey;
    uint32_t Name;
    uint32_t Culture;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << HashAlgId;
        r << MajorVersion;
        r << MinorVersion;
        r << BuildNumber;
        r << RevisionNumber;
        r << Flags;
        r << PublicKey;
        r << Name;
        r << Culture;
        return r;
    }
};

struct AssemblyOS {
    static const uint8_t Number = 0x22;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct AssemblyProcessor {
    static const uint8_t Number = 0x21;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct AssemblyRef {
    static const uint8_t Number = 0x23;
    AssemblyRef(uint32_t name)
      : MajorVersion(0),
        MinorVersion(0),
        BuildNumber(0),
        RevisionNumber(0),
        Flags(0),
        PublicKeyOrToken(0),
        Name(name),
        Culture(0),
        HashValue(0)
    {}

    uint16_t MajorVersion;
    uint16_t MinorVersion;
    uint16_t BuildNumber;
    uint16_t RevisionNumber;
    uint32_t Flags;
    uint32_t PublicKeyOrToken;
    uint32_t Name;
    uint32_t Culture;
    uint32_t HashValue;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << MajorVersion;
        r << MinorVersion;
        r << BuildNumber;
        r << RevisionNumber;
        r << Flags;
        r << PublicKeyOrToken;
        r << Name;
        r << Culture;
        r << HashValue;
        return r;
    }
};

struct AssemblyRefOS {
    static const uint8_t Number = 0x25;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct AssemblyRefProcessor {
    static const uint8_t Number = 0x24;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct ClassLayout {
    static const uint8_t Number = 0x0F;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct Constant {
    static const uint8_t Number = 0x0B;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct CustomAttribute {
    static const uint8_t Number = 0x0C;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct DeclSecurity {
    static const uint8_t Number = 0x0E;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct EventMap {
    static const uint8_t Number = 0x12;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct Event {
    static const uint8_t Number = 0x14;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct ExportedType {
    static const uint8_t Number = 0x27;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct Field {
    static const uint8_t Number = 0x04;
    Field()
      : Flags(0),
        Name(0),
        Signature(0)
    {}

    uint16_t Flags;
    uint32_t Name;
    uint32_t Signature;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << Flags;
        r << Name;
        r << Signature;
        return r;
    }
};

struct FieldLayout {
    static const uint8_t Number = 0x10;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct FieldMarshal {
    static const uint8_t Number = 0x0D;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct FieldRVA {
    static const uint8_t Number = 0x1D;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct File {
    static const uint8_t Number = 0x26;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct GenericParam {
    static const uint8_t Number = 0x2A;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct GenericParamConstraint {
    static const uint8_t Number = 0x2C;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct ImplMap {
    static const uint8_t Number = 0x1C;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct InterfaceImpl {
    static const uint8_t Number = 0x09;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct ManifestResource {
    static const uint8_t Number = 0x28;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct MemberRef {
    static const uint8_t Number = 0x0A;
    MemberRef(uint32_t parent, uint32_t name, uint32_t signature)
      : Parent(parent),
        Name(name),
        Signature(signature)
    {}

    uint32_t Parent;
    uint32_t Name;
    uint32_t Signature;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << Parent;
        r << Name;
        r << Signature;
        return r;
    }
};

struct MethodDef {
    static const uint8_t Number = 0x06;
    MethodDef()
      : RVA(0),
        ImplFlags(0),
        MethodAttributes(0),
        Name(0),
        Signature(0),
        ParamList(0)
    {}

    uint32_t RVA;
    uint16_t ImplFlags;
    uint16_t MethodAttributes;
    uint32_t Name;
    uint32_t Signature;
    uint32_t ParamList;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << RVA;
        r << ImplFlags;
        r << MethodAttributes;
        r << Name;
        r << Signature;
        r << ParamList;
        return r;
    }
};

struct MethodImpl {
    static const uint8_t Number = 0x19;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct MethodSemantics {
    static const uint8_t Number = 0x18;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct MethodSpec {
    static const uint8_t Number = 0x2B;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct Module {
    static const uint8_t Number = 0x00;
    Module()
      : Generation(0),
        Name(0),
        Mvid(0),
        EncId(0),
        EncBaseId(0)
    {}

    uint16_t Generation;
    uint32_t Name;
    uint32_t Mvid;
    uint32_t EncId;
    uint32_t EncBaseId;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << Generation;
        r << Name;
        r << Mvid;
        r << EncId;
        r << EncBaseId;
        return r;
    }
};

struct ModuleRef {
    static const uint8_t Number = 0x1A;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct NestedClass {
    static const uint8_t Number = 0x29;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct Param {
    static const uint8_t Number = 0x08;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct Property {
    static const uint8_t Number = 0x17;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct PropertyMap {
    static const uint8_t Number = 0x15;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct StandAloneSig {
    static const uint8_t Number = 0x11;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct TypeDef {
    static const uint8_t Number = 0x02;
    TypeDef()
      : Flags(0),
        TypeName(0),
        TypeNamespace(0),
        Extends(0),
        FieldList(0),
        MethodList(0)
    {}

    uint32_t Flags;
    uint32_t TypeName;
    uint32_t TypeNamespace;
    uint16_t Extends;
    uint16_t FieldList;
    uint16_t MethodList;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << Flags;
        r << TypeName;
        r << TypeNamespace;
        r << Extends;
        r << FieldList;
        r << MethodList;
        return r;
    }
};

struct TypeRef {
    static const uint8_t Number = 0x01;
    TypeRef(uint32_t resolutionscope, uint32_t type_name, uint32_t typenamespace)
      : ResolutionScope(resolutionscope),
        TypeName(type_name),
        TypeNamespace(typenamespace)
    {}

    uint32_t ResolutionScope;
    uint32_t TypeName;
    uint32_t TypeNamespace;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << ResolutionScope;
        r << TypeName;
        r << TypeNamespace;
        return r;
    }
};

struct TypeSpec {
    static const uint8_t Number = 0x1B;

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        return r;
    }
};

struct Metadata_tables {
    Metadata_tables()
      : Reserved1(0),
        MajorVersion(2),
        MinorVersion(0),
        HeapSizes(0x7),
        Reserved2(1),
        //Valid(0),
        Sorted(0)
    {}

    uint32_t Reserved1;
    uint8_t MajorVersion;
    uint8_t MinorVersion;
    uint8_t HeapSizes;
    uint8_t Reserved2;
    //uint64_t Valid;
    uint64_t Sorted;
    std::vector<Module> Module_Table;                                   // 0x00
    std::vector<TypeRef> TypeRef_Table;                                 // 0x01
    std::vector<TypeDef> TypeDef_Table;                                 // 0x02
    std::vector<Field> Field_Table;                                     // 0x04
    std::vector<MethodDef> MethodDef_Table;                             // 0x06
    std::vector<Param> Param_Table;                                     // 0x08
    std::vector<InterfaceImpl> InterfaceImpl_Table;                     // 0x09
    std::vector<MemberRef> MemberRef_Table;                             // 0x0A
    std::vector<Constant> Constant_Table;                               // 0x0B
    std::vector<CustomAttribute> CustomAttribute_Table;                 // 0x0C
    std::vector<FieldMarshal> FieldMarshal_Table;                       // 0x0D
    std::vector<DeclSecurity> DeclSecurity_Table;                       // 0x0E
    std::vector<ClassLayout> ClassLayout_Table;                         // 0x0F
    std::vector<FieldLayout> FieldLayout_Table;                         // 0x10
    std::vector<StandAloneSig> StandAloneSig_Table;                     // 0x11
    std::vector<EventMap> EventMap_Table;                               // 0x12
    std::vector<Event> Event_Table;                                     // 0x14
    std::vector<PropertyMap> PropertyMap_Table;                         // 0x15
    std::vector<Property> Property_Table;                               // 0x17
    std::vector<MethodSemantics> MethodSemantics_Table;                 // 0x18
    std::vector<MethodImpl> MethodImpl_Table;                           // 0x19
    std::vector<ModuleRef> ModuleRef_Table;                             // 0x1A
    std::vector<TypeSpec> TypeSpec_Table;                               // 0x1B
    std::vector<ImplMap> ImplMap_Table;                                 // 0x1C
    std::vector<FieldRVA> FieldRVA_Table;                               // 0x1D
    std::vector<Assembly> Assembly_Table;                               // 0x20
    std::vector<AssemblyProcessor> AssemblyProcessor_Table;             // 0x21
    std::vector<AssemblyOS> AssemblyOS_Table;                           // 0x22
    std::vector<AssemblyRef> AssemblyRef_Table;                         // 0x23
    std::vector<AssemblyRefProcessor> AssemblyRefProcessor_Table;       // 0x24
    std::vector<AssemblyRefOS> AssemblyRefOS_Table;                     // 0x25
    std::vector<File> File_Table;                                       // 0x26
    std::vector<ExportedType> ExportedType_Table;                       // 0x27
    std::vector<ManifestResource> ManifestResource_Table;               // 0x28
    std::vector<NestedClass> NestedClass_Table;                         // 0x29
    std::vector<GenericParam> GenericParam_Table;                       // 0x2A
    std::vector<MethodSpec> MethodSpec_Table;                           // 0x2B
    std::vector<GenericParamConstraint> GenericParamConstraint_Table;   // 0x2C

    std::vector<uint8_t> serialize() const {
        std::vector<uint8_t> r;
        r << Reserved1;
        r << MajorVersion;
        r << MinorVersion;
        r << HeapSizes;
        r << Reserved2;
        uint64_t valid = 0;
        update_valid(valid, Module_Table);
        update_valid(valid, TypeRef_Table);
        update_valid(valid, TypeDef_Table);
        update_valid(valid, Field_Table);
        update_valid(valid, MethodDef_Table);
        update_valid(valid, Param_Table);
        update_valid(valid, InterfaceImpl_Table);
        update_valid(valid, MemberRef_Table);
        update_valid(valid, Constant_Table);
        update_valid(valid, CustomAttribute_Table);
        update_valid(valid, FieldMarshal_Table);
        update_valid(valid, DeclSecurity_Table);
        update_valid(valid, ClassLayout_Table);
        update_valid(valid, FieldLayout_Table);
